docs/site/belet03_live_perfor_inter_human_machin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>belet03_live_perfor_inter_human_machin</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">belet03_live_perfor_inter_human_machin</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaaf76d1">Live Performance Interaction for Humans and Machines in the Early Twenty-First Century</a>
<ul>
<li><a href="#org1a78400">Tech</a></li>
<li><a href="#org6fb64de">Art</a></li>
<li><a href="#org959eeaf">20th Century Machines</a></li>
<li><a href="#org7623ad0">Audiences</a></li>
<li><a href="#orgb58c50b">Aesthetics</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgaaf76d1" class="outline-2">
<h2 id="orgaaf76d1">Live Performance Interaction for Humans and Machines in the Early Twenty-First Century</h2>
<div class="outline-text-2" id="text-orgaaf76d1">
</div>

<div id="outline-container-org1a78400" class="outline-3">
<h3 id="org1a78400">Tech</h3>
<div class="outline-text-3" id="text-org1a78400">
<p>
Technology always influences art.
</p>

<p>
<code>The multiple relationships between technology and composer and performer are dynamic and of paramount importance to each party. And a true consideration of any aspect of music requires that all three areas be examined.</code>
</p>
</div>
</div>

<div id="outline-container-org6fb64de" class="outline-3">
<h3 id="org6fb64de">Art</h3>
<div class="outline-text-3" id="text-org6fb64de">
<p>
<code>Art reflects its own time and place. If art needs to have a function within society then this is one (another being that art can forge the way for society's future).</code>
</p>
</div>
</div>

<div id="outline-container-org959eeaf" class="outline-3">
<h3 id="org959eeaf">20th Century Machines</h3>
<div class="outline-text-3" id="text-org959eeaf">
<p>
Machines have been portrayed both as the time-saving miracle and the diabolical threat to humanity. This has been charactarized in both ways in literature, film, and theatre. 
</p>

<p>
quoting Garnett <code>One cannot turn one's back on the most significant technological breakthrough in history without risking irrelevance to that history</code>
</p>
</div>
</div>

<div id="outline-container-org7623ad0" class="outline-3">
<h3 id="org7623ad0">Audiences</h3>
<div class="outline-text-3" id="text-org7623ad0">
<p>
<code>Audiences are also invited to modify their conservatory-preserved concert aesthetics as they ecounter a unique event with each performance of a work. This requires dedicated active listening by a knowledgeable audience with an understanding of both deep and surface musical structures, as was necessary when Mozart and Beethoven performed their own piano sonatas, and which is still necessary today when listening actively to jazz and progressive rock. This is the classical tradition, so interactive computer music is actually adhering to a long-established and respected cultural paradigm.</code>
</p>
</div>
</div>

<div id="outline-container-orgb58c50b" class="outline-3">
<h3 id="orgb58c50b">Aesthetics</h3>
<div class="outline-text-3" id="text-orgb58c50b">
<p>
<code>Composers, performers and listeners have the added task of discarding their inherited machine aesthetics from the last century, both the overly positive and the genralised negative. Current directions in computer technology are integrating the various aspects of music creation and performance into a seamless synergy, and there is no reason to assume that this trend can or should be reversed.</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
